Dlubal.RFEM5.SolidAxesDirection
Direction of solid axes

Dlubal.RFEM5.SolidAxesDirection.UnknownSolidAxesDirection
Unknown axes direction

Dlubal.RFEM5.SolidAxesDirection.StandardSolidAxesDirection
Standard axes direction

Dlubal.RFEM5.SolidAxesDirection.SolidAxesXYParallelToSurface
Axes x,y parallel to boundary surface

Dlubal.RFEM5.SolidAxesDirection.SolidAxisXParallelToLine
Axis x parallel to line

Dlubal.RFEM5.SolidAxesDirection.SolidAxisYParallelToLine
Axis y parallel to line

Dlubal.RFEM5.SolidAxesDirection.SolidAxisXParallelToSurface
Axis x parallel to surface and axis z direct to point

Dlubal.RFEM5.SolidAxesDirection.SolidAxisYParallelToSurface
Axis y parallel to surface and axis z direct to point

Dlubal.RFEM5.SolidAxesDirection.SolidAxesParallelToUserCS
Axes parallel to user-defined coordinate system